# FabricSheetPhysicalMaterialAsset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetPhysicalMaterialAsset Property
ParameterTypeId Class See Also
---
"Physical Material Asset": Physical Material Asset
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetPhysicalMaterialAsset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetPhysicalMaterialAsset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetPhysicalMaterialAsset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace